# Built In Failures Toposolid Boolean Perturbation Failures Class

Source: https://www.revitapidocs.com/2026/244185e6-2cc9-9052-5737-6f77e3f10e00.htm

---

| Built In Failures Toposolid Boolean Perturbation Failures Class |
| --- |

Inheritance Hierarchy System Object
Autodesk.Revit.DB BuiltInFailures ToposolidBooleanPerturbationFailures

**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static class ToposolidBooleanPerturbationFailures
```

```
Public NotInheritable Class ToposolidBooleanPerturbationFailures
```

```
public ref class ToposolidBooleanPerturbationFailures abstract sealed
```

```
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ToposolidBooleanPerturbationFailures = class end
```
The BuiltInFailures ToposolidBooleanPerturbationFailures type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | NonPerturbationBooleanFailed | Boolean operation failed without perturbation. |

Top See Also

#### Reference

Autodesk.Revit.DB Namespace